Revit 2027 API
Wave.WaveWaveLenMax Property
 The property labeled "Len Max" from the "Wave" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string WaveWaveLenMax { get; }
Public Shared ReadOnly Property WaveWaveLenMax As String
	Get
public:
static property String^ WaveWaveLenMax {
	String^ get ();
}
static member WaveWaveLenMax : string with get
Property Value
String
Remarks
 This property is of type "AssetPropertyDouble" within the range of "0, 1000000000".
See Also
Reference
Wave Class
Autodesk.Revit.DB.Visual Namespace